#вводим координаты
x1 = int(input())
y1 = int(input())
x2 = int(input())
y2 = int(input())

#определяем координатные четверти точек
q1 = ''
q2 = ''

if x1 > 0 and y1 > 0:
    q1 = 'I' #точка (x1,y1) лежит в 1 координатной четверти
elif x1 < 0 and y1 > 0:
    q1 = 'II' #точка (x1,y1) лежит в 2 координатной четверти
elif x1 < 0 and y1 < 0:
    q1 = 'III' #точка (x1,y1) лежит в 3 координатной четверти
elif x1 > 0 and y1 < 0:
    q1 = 'IV' #точка (x1,y1) лежит в 4 координатной четверти


if x2 > 0 and y2 > 0:
    q2 = 'I' #точка (x1,y1) лежит в 1 координатной четверти
elif x2 < 0 and y2 > 0:
    q2 = 'II' #точка (x1,y1) лежит в 2 координатной четверти
elif x2 < 0 and y2 < 0:
    q2 = 'III' #точка (x1,y1) лежит в 3 координатной четверти
elif x2 > 0 and y2 < 0:
    q2 = 'IV' #точка (x1,y1) лежит в 4 координатной четверти

if q1 == q2:
    print('Yes,', q1)
else:
    print('No')