#считываем показания счётчика в предыдущем месяце
previous_read = float(input('Введите показания счётчика в предыдущем месяце: '))

#пока показания счётчика вводятся некорректно, просим ввести заново
while previous_read < 0 or previous_read > 9999:
    previous_read = float(input('Введите число в пределах от 0 до 9999: '))

#то же и для показаний текущего месяца
current_read = float(input('Введите показания счётчика в текущем месяце: '))

while current_read < 0 or current_read > 9999:
    current_read = float(input('Введите число в пределах от 0 до 9999: '))

#рассчитываем, сколько кубометров газа использовано
gas_used = current_read - previous_read

#если в течение месяца счётчик перешёл отметку в 0 кубометров, учитываем это
if current_read <= previous_read:
    gas_used += 10000

#инициализируем массив, в котором будут храниться объёмы газов за свои стоимости (0.06$, 0.04$ и 0.025$)
amount_for_price = [0.0, 0.0, 0.0]

#если использовано больше 300 м³ — записываем в ячейку стоимости 0.06$ за 1 м³ остальное
if gas_used > 300:
    amount_for_price[0] = gas_used - 300

#если использовано больше 600 м³ — записываем в ячейку стоимости 0.04$ за 1 м³ остальное,
#а в ячейку 0.06$ за 1 м³ — разность порогов объёма для этой стоимости (600 - 300 = 300)
if gas_used > 600:
    amount_for_price[1] = amount_for_price[0] - 300
    amount_for_price[0] = 300

#если использовано больше 800 м³ — записываем в ячейку стоимости 0.025$ за 1 м³ остальное,
#а в ячейку 0.04$ за 1 м³ — разность порогов объёма для этой стоимости (800 - 600 = 200)
if gas_used > 800:
    amount_for_price[2] = amount_for_price[1] - 200
    amount_for_price[1] = 200

#вычисляем общую стоимость использованного газа по формуле 21$ + N1 * 0.06$ + N2 * 0.04$ + N3 * 0.025$
#и среднюю стоимость по формуле Общая стоимость / N,
#где N1, N2, N3, N — объёмы газа за 0.06$/м³, 0.04$/м³, 0.025$/м³ и общий объём соответственно
price = round(21 + amount_for_price[0] * 0.06 + amount_for_price[1] * 0.04 + amount_for_price[2] * 0.025, 2)
average = round(price / gas_used, 2)

#задаём каждую строку таблицы как пустую строчку для дальнейшей работы с форматированием таблицы
row1 = ''
row2 = ''

#для форматирования таблицы, где каждая ячейка выравнивается по центру, задаём списки с названиями
#столбцов и значениями ячеек, чтобы для каждого столбца найти максимальную длину строки
columns = ['Предыдущее', 'Текущее', 'Использовано', 'К оплате', 'Ср. цена м³']
values = [str(previous_read), str(current_read), str(gas_used), f'{price:.2f}', f'{average:.2f}']

#для каждого столбца ищем максимальную длину строки и используем её для форматирования таблицы:
#каждая ячейка таблицы выровнена по центру, с отступами в 4 пробела между ячейками
for i in range(len(columns)):
    max_len = max(len(columns[i]), len(values[i]))
    row1 += f'{columns[i]: ^{max_len}}'
    row2 += f'{values[i]: ^{max_len}}'

    if i < len(columns) - 1:
        row1 += ' ' * 4
        row2 += ' ' * 4

#выводим таблицу
print(row1)
print(row2)