input_string = 'Введите номер файла: '

# открываем файл
while True:
    # вводим номер файла
    n = int(input(input_string))

    # если файл существует — открываем его и записываем его строки в lines, если нет — просим ввести n заново
    try:
        with open(f'{n}.ChaseData.txt', 'r') as file1:
            lines = file1.read().splitlines()

        break
    except FileNotFoundError:
        input_string = f'Файл {n}.ChaseData.txt не существует, создайте этот файл или введите другой номер файла: '

#задаём сетку размером rows x cols (кол-во строк на кол-во столбцов)
rows = int(lines[0].split()[0])
cols = int(lines[0].split()[1])

#сразу записываем в список строк для вывода первую строку
output = ['Cat and Mouse\n\n']

#для форматирования таблицы, где каждая ячейка выравнивается по центру, задаём списки с названиями
#столбцов и значениями ячеек, чтобы для каждого столбца найти максимальную длину строки
column_names = ['Cat', 'Mouse', 'Distance']
column_values = [f'({rows},{cols})', f'({rows},{cols})', str(rows + cols - 2)] #так как расстояние между
#котом и мышью — это сумма длины и ширины прямоугольника, в противоположных углах которого находятся
#кот и мышь, уменьшенная на 2, то максимальное значение расстояния между ними — это сумма размеров сетки,
#уменьшенная на 2

#задаём список максимальных длин каждой строки, чтобы рассчитать их сразу и потом только использовать для
#форматирования каждой строки таблицы
column_max_len = []

#добавляем в список строк для вывода пустую строчку, с которой будем дальше работать
output.append('')

#для каждого столбца ищем максимальную длину строки и используем её для форматирования таблицы,
#название каждого столбца таблицы выровнено по центру
for j in range(len(column_names)):
    column_max_len.append(max(len(column_names[j]), len(column_values[j])))
    output[1] += f'{column_names[j]: ^{column_max_len[j]}}'

    if j == 0:
        output[1] += ' ' * 5 #отступ между ячейками 1 и 2 — 5 пробелов
    elif j == 1:
        output[1] += ' ' * 3 #отступ между ячейками 2 и 3 — 3 пробела
    else:
        output[1] += '\n' #в конце строки дописываем переход на новую строку

#рисуем черту длиной в предыдущую строчку (символ \n в предыдущей строке не учитываем)
output.append('-' * (len(output[1]) - 1) + '\n')

#задаём переменную индекса в списке строк для вывода, в списке уже есть строки с индексами 0, 1 и 2,
#значит следующая строка будет с индексом 3 и так далее
k = 3
